# Custom brew file for Stefan
### taps
tap "leoafarias/fvm"

#bat (> cat but better)
brew "bat"
### Override system cocoapods
brew "cocoapods", link: :overwrite
### Fuzzy finding files { nvim }
brew "fd"
### Flutter Development
brew "fvm"
### Fuzzy finding files { zoxide, nvim }
brew "fzf"
### Printing json and viewing json
brew "jless"
### Working with json
brew "jq"
### Lazy git
brew "lazygit"
### lua language support
brew "lua"
### Lua packeage manager { nvim }
brew "luarocks"
### Mise
brew "mise"
### Neovim { nvim }
brew "neovim"
### Node environment
brew "node"
### Java
brew "openjdk@17"
### Powerlevel 10k
brew "powerlevel10k"
### rg for greping  { nvim }
brew "ripgrep"
### Ruby 
brew "ruby"
### Styllua for code formating
brew "stylua"
### Linter for swift
brew "swiftlint"
### Treesitter CLI for treesitter§ { nvim }
brew "tree-sitter-cli"
###  wget
brew "wget"
### zoxide
brew "zoxide"

### Android Studio
cask "android-studio" unless system  '[[ -e "/Applications/Android studio.app" ]]'
### Firefox
cask "firefox" unless system '[[ -e "/Applications/Firefox.app" ]]'
### Google Chrome
cask "google-chrome" unless system '[[ -e "/Applications/Google Chrome.app" ]]'
### vs code
cask "visual-studio-code" unless system '[[ -e "/Applications/Visual Studio Code.app" ]]'

## Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"

